const poemData= [
  {
    title: "桃花庵歌",
    author: "[明代]唐寅",
    content:"桃花坞里桃花庵，桃花庵下桃花仙。桃花仙人种桃树，又折花枝当酒钱。酒醒只在花前坐，酒醉还须花下眠。花前花後日复日，酒醉酒醒年复年。不愿鞠躬车马前，但愿老死花酒间。车尘马足贵者趣，酒盏花枝贫者缘。若将富贵比贫贱，一在平地一在天。若将贫贱比车马，他得驱驰我得闲。世人笑我忒风颠，我咲世人看不穿。记得五陵豪杰墓，无酒无花锄作田。"
  },
  {
    title: "将进酒",
    author: "[唐代]李白",
    content:"君不见， 黄河之水天上来， 奔流到海不复回。君不见， 高堂明镜悲白发， 朝如青丝暮成雪。人生得意须尽欢， 莫使金樽空对月。天生我材必有用， 千金散尽还复来。烹羊宰牛且为乐， 会须一饮三百杯。岑夫子， 丹丘生， 将进酒， 杯莫停。与君歌一曲， 请君为我倾耳听。钟鼓馔玉不足贵， 但愿长醉不愿醒。古来圣贤皆寂寞， 惟有饮者留其名。陈王昔时宴平乐， 斗酒十千恣欢谑。主人何为言少钱， 径须沽取对君酌。五花马， 千金裘， 呼儿将（jiāng）出换美酒， 与尔同销万古愁。"
  },
  {
    title: "望庐山瀑布",
    author: "[唐代]李白",
    content: "日照香炉生紫烟，遥看瀑布挂前川。飞流直下三千尺，疑是银河落九天。"
  }
]


export default poemData